tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationApp.cpp
void IrrigationApp::refreshRtcCondition(uint32_t nowMs, bool force) {
    constexpr uint32_t kRtcRefreshIntervalMs = 60000U;
    if (!force && rtcObservationInitialized_ &&
        static_cast<uint32_t>(nowMs - lastRtcRefreshMs_) < kRtcRefreshIntervalMs) {
        return;
    }
    if (rtcObservationInitialized_) Esp32BaseRtc::refresh();
    rtcObservationInitialized_ = true;
    lastRtcRefreshMs_ = nowMs;
    events_.observeRtcAvailability(Esp32BaseRtc::isAvailable(),
                                   static_cast<uint8_t>(Esp32BaseRtc::status()));
}

void IrrigationApp::observeEventConditions(uint32_t nowMs,
                                           const Esp32BaseTime::Snapshot& now) {
    events_.observeTrustedTime(now.synced);
    Esp32BaseConditions::ObservedState rollbackState =
        Esp32BaseConditions::ObservedState::Unknown;
    if (wateringScheduler_.timeState() == WateringScheduler::TimeState::Ready) {
        rollbackState = Esp32BaseConditions::ObservedState::Inactive;
    } else if (wateringScheduler_.timeState() == WateringScheduler::TimeState::RtcRollback) {
        rollbackState = Esp32BaseConditions::ObservedState::Active;
    }
    events_.observeRtcRollback(rollbackState);

    const IrrigationConfig* config = configStore_.current();
    Esp32BaseConditions::ObservedState flowState =
        Esp32BaseConditions::ObservedState::Unknown;
    if (config && !wateringController_.active() &&
        unexpectedFlowMonitor_.observationReady(nowMs)) {
        flowState = unexpectedFlowMonitor_.alarmActive()
                        ? Esp32BaseConditions::ObservedState::Active
                        : Esp32BaseConditions::ObservedState::Inactive;
    }
    uint32_t detectedFlowMlPerMinute = 0;
    if (config && config->flowProtection.unexpectedFlowWindowSec != 0U) {
        const uint64_t pulseRateX10000 =
            static_cast<uint64_t>(unexpectedFlowMonitor_.observedPulseCount()) *
            10000ULL /
            config->flowProtection.unexpectedFlowWindowSec;
        if (pulseRateX10000 <= UINT32_MAX) {
            FlowMonitor::pulseRateX10000ToFlowMlPerMinute(
                static_cast<uint32_t>(pulseRateX10000),
                config->flowMeter.pulsesPerLiterX100,
                detectedFlowMlPerMinute);
        }
    }
    events_.observeClosedValveFlow(
        flowState,
        unexpectedFlowMonitor_.observedPulseCount(),
        detectedFlowMlPerMinute,
        config ? config->flowProtection.unexpectedFlowWindowSec : 0,
        config ? config->flowProtection.unexpectedFlowPulseCount : 0);
}

WateringStartResult IrrigationApp::startScheduledWatering(const WateringRequest& request,
                                                          void* user) {
    return user ? static_cast<IrrigationApp*>(user)->startWatering(request)
                : WateringStartResult::NotReady;
}

void IrrigationApp::handleSchedulerEvent(WateringScheduler::Event event,
                                         uint8_t planId,
                                         int32_t value,
                                         void* user) {
    if (user) {
        static_cast<IrrigationApp*>(user)->reportSchedulerEvent(event, planId, value);
    }
}

void IrrigationApp::reportSchedulerEvent(WateringScheduler::Event event,
                                         uint8_t planId,
                                         int32_t value) {
    switch (event) {
        case WateringScheduler::Event::PausedIndefinitely:
            events_.recordAutomaticWateringPaused(true, 0);
            break;
        case WateringScheduler::Event::PausedUntil:
            events_.recordAutomaticWateringPaused(
                false, wateringScheduler_.automaticState().resumeAtEpoch);
            break;
        case WateringScheduler::Event::ResumedManually:
            events_.recordAutomaticWateringResumed(false);
            break;
        case WateringScheduler::Event::ResumedAutomatically:
            events_.recordAutomaticWateringResumed(true);
            break;
        case WateringScheduler::Event::PlanSkippedBusy:
        case WateringScheduler::Event::PlanStartRejected: {
            reportSkippedPlan(planId, static_cast<WateringStartResult>(value));
            break;
        }
        case WateringScheduler::Event::StorageFault:
            schedulerStorageFault_ = true;
            break;
    }
}

// The full learning/status snapshot belongs only to this branch. Keep its
// stack frame out of pause/resume -> audit -> LittleFS writes, including LTO.
void IrrigationApp::reportSkippedPlan(uint8_t planId, WateringStartResult result) {
    const IrrigationConfig* config = configStore_.current();
    const char* planName = nullptr;
    if (config && planId >= 1U && planId <= config->plans.size() &&
        config->plans[planId - 1U].configured) {
        planName = config->plans[planId - 1U].name.data();
    }
    events_.recordAutomaticPlanSkipped(planId, planName, result, wateringController_.status());
}

bool IrrigationApp::allowMaintenance(void* user) {
    auto* app = static_cast<IrrigationApp*>(user);
    return app && !app->wateringController_.active() && app->pendingLearnedZoneId_ == 0;
}

bool IrrigationApp::allowOta(void* user) {
    auto* app = static_cast<IrrigationApp*>(user);
    return allowMaintenance(user) && !app->wateringController_.finishedSession() &&
           !app->events_.auditStore().hasPending();
}

void IrrigationApp::beforeLifecycleStop(void* user) {
    auto* app = static_cast<IrrigationApp*>(user);
    // Hardware closure always precedes filesystem work and bounded network waits.
    if (!app) return;
    app->wateringController_.safeShutdown();
    app->consumeFinishedWatering(millis());
    app->businessReady_ = false;
}

void IrrigationApp::afterFormatFs(const Esp32BaseWeb::FormatFsResult& result, void* user) {
    if (user) {
        static_cast<IrrigationApp*>(user)->handleAfterFormatFs(result);
    }
}

void IrrigationApp::handleAfterFormatFs(const Esp32BaseWeb::FormatFsResult& result) {
    wateringController_.safeShutdown();
    businessReady_ = false;

    if (!result.formatSuccess || !result.mountSuccess) {
        recordStorageFault_ = true;
        return;
    }

    // Explicit successful formatting discards the old generation, including
    // any completed RAM facts; they must not reappear in the new empty history.
    wateringController_.clearFinishedSession();
    finishedWateringStored_ = false;
    wateringStartTime_ = {};
    wateringStartTimeValid_ = false;
    const bool conditionHistoryReset = events_.resetConditionHistory();
    const bool iotRecordStreamReady =
        IrrigationRecordSync::instance().resetGenerationsAfterFormat();
    rtcObservationInitialized_ = false;
    eventConditionsInitialized_ = false;

    bool configReady = configStore_.begin();
    if (configReady) configReady = applyStoredParameterConfig();
    const IrrigationConfig* config = configStore_.current();
    const bool pwmReady = configReady && config &&
                          wateringController_.begin(
                              config->valveDrive.pwmFrequencyHz);
    const bool schedulerCleared = wateringSchedulerStore_.clear();
    wateringScheduler_.setCallbacks(nullptr, nullptr, nullptr);
    const bool schedulerLoaded = wateringScheduler_.begin(wateringSchedulerStore_);
    wateringScheduler_.setCallbacks(startScheduledWatering, handleSchedulerEvent, this);
    const bool schedulerReady = schedulerCleared && schedulerLoaded;
    if (!schedulerReady) {
        wateringScheduler_.disable();
    }
    const bool checkpointReady = aliveCheckpoint_.begin();
    schedulerStorageFault_ = !schedulerReady;
    Esp32BaseRecordStore::StoreStatus wateringStatus{};
    Esp32BaseRecordStore::StoreStatus auditStatus{};
    const bool recordsReady = result.businessRecordStoresReloadSuccess &&
        wateringRecordStore_.readStatus(wateringStatus) &&
        events_.auditStore().readStatus(auditStatus) &&
        wateringStatus.ready && wateringStatus.writable &&
        auditStatus.ready && auditStatus.writable && iotRecordStreamReady;
    if (!recordsReady) {
        ESP32BASE_LOG_E("irrigation",
                        "business_record_stores_recovery_failed base_reload=%s watering=%s audit=%s",
                        result.businessRecordStoresReloadSuccess ? "success" : "failed",
                        Esp32BaseRecordStore::storeStateName(wateringStatus.state),
                        Esp32BaseRecordStore::storeStateName(auditStatus.state));
    }
    recordStorageFault_ = false; // Per-stream readiness remains visible through the sync layer.
    businessReady_ = configReady && pwmReady;
    if (businessReady_) {
        resetUnexpectedFlowMonitor(millis());
    }
    if (!businessReady_) {
        wateringController_.safeShutdown();
    }
    ESP32BASE_LOG_W("irrigation",
                    "after_format_reinitialized business_ready=%s records_ready=%s scheduler_ready=%s checkpoint_ready=%s condition_history_reset=%s",
                    businessReady_ ? "yes" : "no",
                    recordsReady ? "yes" : "no",
                    schedulerReady ? "yes" : "no",
                    checkpointReady ? "yes" : "no",
                    conditionHistoryReset ? "yes" : "no");
}
